<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"2408bd25021fdda1ff909f7e7b83e78bea93e4f65323a5824393104d4f07d04d","plan_job_ref":"Job Pull Request Checks #4257 at https://github.com/GSA-TTS/FAC/actions/runs/12955159769","plan_out_hash":"46cb06ddc6e7a4ef8d0b8d6a8ea5fef8516b0f318df5b763685a122dc2088575","plan_hash":"1a88041e5933f76239b9bacf9cafc9a9673de40a181db9a375b4ddba12dc49d1","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-01-24T19:46:02Z" -> (known after apply)
        }
    }

  # module.production.module.newrelic.newrelic_one_dashboard_json.fac_monitoring is tainted, so must be replaced
-/+ resource "newrelic_one_dashboard_json" "fac_monitoring" {
!~      account_id = 3919076 -> (known after apply)
!~      guid       = "MzkxOTA3NnxWSVp8REFTSEJPQVJEfGRhOjc5NjgyNDk" -> (known after apply)
!~      id         = "*******************************************" -> (known after apply)
!~      permalink  = "https://one.newrelic.com/redirect/entity/MzkxOTA3NnxWSVp8REFTSEJPQVJEfGRhOjc5NjgyNDk" -> (known after apply)
!~      updated_at = "2025-01-24T19:46:00Z" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4257](https://github.com/GSA-TTS/FAC/actions/runs/12955159769)